{"class_name": "Model", "keras_version": "1.1.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": [], "name": "inputs"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inputs", 0, 0]]], "name": "conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "conv2"}, {"class_name": "MaxPooling2D", "config": {"name": "maxp2", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["conv2", 0, 0]]], "name": "maxp2"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "drop1"}, "inbound_nodes": [[["maxp2", 0, 0]]], "name": "drop1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["drop1", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "drop2"}, "inbound_nodes": [[["dense1", 0, 0]]], "name": "drop2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "outputs", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 10}, "inbound_nodes": [[["drop2", 0, 0]]], "name": "outputs"}], "input_layers": [["inputs", 0, 0]], "output_layers": [["outputs", 0, 0]], "name": "model_1"}}